{
  "language": "idioma:",
  "learnMore": "Saiba <br> mais",
  "code": "Código",
  "close": "Fechar",
  "about": {
    "title": "Sobre",
    "img": {
      "me": "Uma foto minha sorrindo. Eu sou branco, tenho um longo cabelo castanho e um rosto fino. Atrás de mim há uma cortina cinza. Estou usando uma camisa branca."
    },
    "p1": "Olá! Meu nome é Arturo Fonseca de Souza. Eu tenho 24 anos e sou graduado em TI pela Universidade Federal do Rio Grande do Norte (UFRN). Atualmente estou cursando Ciência da Computação também na UFRN. Nos últimos 3 anos eu venho trabalhando com <em>desenvolvimento web</em> em projetos de bolsas da minha universidade, aprofundando meu conhecimento tanto em tecnologias de <em>backend</em> como de <em>frontend</em>.",
    "p2": "Eu gosto bastante de aprender coisas novas e torná-las mais acessíveis para pessoas. Essa foi uma das principais motivações por trás <span style=\"text-decoration: line-through\">de um dos meus mais queridos projetos pessoais</span> <em>do meu futuro TCC</em>: um site onde qualquer pessoa consegue visualizar e entender <a href=\"https://github.com/arturo32/HowPointersWork/blob/main/README(pt-br).md\"> como ponteiros funcionam</a> em linguagens de programação. Ele ainda está em seu desenvolvimento inicial, mas eu estou determinado em acabá-lo esse ano!",
    "p3": "Além de desenvolver aplicações web, eu tenho uma grande paixão por geometria e matemática no geral. Isso me levou a descobrir as maravilhas da <em>computação gráfica</em>. Por isso é possível encontrar muitos projetos pessoais ou de disciplinas que envolvam geometria, vetores e gráficos neste site.",
    "p4": "Meus outros interesses envolvem dobrar origami, tirar fotos, mexer um pouco com eletrônica e assistir vídeos sobre teoria musical!",
    "linkedin": "<span class=\"linkedin-icon icon\" aria-hidden=\"true\"></span>meu LinkeIn",
    "github": "<span class=\"github-icon icon\" aria-hidden=\"true\"></span>meu GitHub"
  },
  "projects": {
    "title": "Projetos",
    "hpw": {
      "title": "Como Ponteiros Funcionam",
      "preview": "GIF do site sendo usado.",
      "description": "Projeto pessoal educacional sobre a magia dos ponteiros e como eles se comportam na memória.",
      "p1": "Quando eu vi meus colegas tendo dificuldade com o conceito de ponteiros em disciplinas introdutórias de programação, eu pensei em escrever um programa que pudesse ajudá-los a visualizar o que acontece na memória do computador quando eles rodam seus programas.",
      "p2": "Então há 2 anos eu comecei a desenvolver um site que mostra a alocação de memória de variáveis e seus ponteiros ao mesmo tempo em que são digitados pelo usuário em um console.",
      "p3": "Até agora o site pode identificar declaração e atribuição de variáveis e ponteiros, seus tipos e derreferenciamento de ponteiros. Ele ainda não pode identificar arrays (que podem ser vistos como um tipo de ponteiro nas linguagens C e C++). Eu planejo migrar para o framework Vue.js e remover a biblioteca p5.js, deixando a visualização de células de memórias mais interativas.",
      "p4": "Eu falo mais sobre ele na página do projeto abaixo."
    },
    "ecoleta": ""
  },
  "others": {
    "title": "Outros"
  }
}
